# 如果一个 3 位数等于其各位数字的立方和，则称这个数为水仙花数。例如：153 = 1^3 + 5^3 + 3^3，因此 153 就是一个水仙花数。
# 难点：怎么表示个位、十位、百位的数字


for n in range(1, 10):
    for h in range(0, 10):
        for j in range(0, 10):
            i = n * 100 + h * 10 + j
            if n**3 + h**3 + j**3 == i:
               print(f"{i}是水仙花数")
#运行逻辑：当最外层的n取1时，发现还有里面两层循环，就执行第二层循环，h=0,又开执行最里面的循环：j=0---->j=9,
#最内层所有循环都执行完一遍后，返回第二层执行下一个，h=1,然后再执行最里面的循环，---
#当第二次循环都执行了一遍以后，才返回最外层的循环，n=2，然后又回到第二层，h=0,又执行最里面的循环j=0--->j=9,
#一直到n=9,遍历完数列。

for i in range(100, 500):  # 水仙花数必须是三位数，从100开始
    # 提取百位、十位、个位
    hundreds = i // 100        # 百位：整数除法
    tens = (i // 10) % 10      # 十位
    ones = i % 10      

    #// (整除) 拿来“砍掉尾巴”，整除，地板除。得到整数，去掉小数点
    # % (取余) 拿来“留下尾巴”。   去掉整数，留下余数。

    # 计算各位的立方和
    if hundreds**3 + tens**3 + ones**3 == i:
        print(f"{i} 是水仙花数")

for i in range(100,500):
    list1=list(str(i))
    #此时的list1=['1','5','3']列表里面的元素是字符串，不能直接运算，要int转化成整数
    # int(list1[0])

    digite=list(map(int,str(i)))
    #str(i),把遍历的i字符串化，map()函数：把每个str(i)中的元素取出来，用int转化为整数，形成一个迭代器，最后被list转化为列表，里面元素都是整数。
    digits = [int(x) for x in str(i)]
        #列表推导式写法

    if int(list1[0])**3+int(list1[1])**3+int(list1[2])**3==i:
        print(f"{i} 是水仙花数")


#答案
for i in range(100, 1000):
    sum = 0
    temp = i
    
    while temp:
        sum = sum + (temp % 10) ** 3
        temp //= 10
    
    if sum == i:
        print(i)