# continue与break区别:break完全跳出循环，continue只跳出本轮循环但是还会进入下轮的循环(重新循环).

i = 0  # 注意i的初始化数值，是1还是0.
while i < 10:  # 循环条件，当计数器i<10的时候，一直循环
    i = i + 1  # 计数器累加，从0开始，第一次循环的计数器是1
    if i % 2 == 0:  # 如果为偶数，循环继续.求余数.如果==1就是奇数啦.1%2=商是0.5，余数是多少？余数1
        continue  # 条件成立，继续循环.
print(i)  # print语句缩进再while内，说明要打印每次循环的结果.如果与while缩进相同，就只打印循环结束的值.
# ---->1 3 5 7 9


"""
余数是 整数 除法中的概念，满足两个核心规则:
被除数 = 除数 * 整数商 + 余数;
余数必须满足:0 <= 余数 < 除数(余数不能是小数，且必须小于除数).
用这个规则算 1 ÷ 2:
除数是 2，能找到的最大整数商是0(因为 2*0=0 <=1，而 2*1=2 >1);
代入公式:1 = 2*0 + 余数 -> 余数 = 1 - 0 = 1.
"""

# else语句:当条件不为真的时候，就会执行else语句

i = 1
while i < 10:  # 循环9次，第10次等于10了，不符合条件了，就执行else语句.
    print(f'循环内的i的值是:{i}')
    i = i + 1
else:
    print(f'循环外值是{i}')
    print('循环外的值是', i)  # 这个语法与(f'循环外的值是{i})一样.

day = 0
while day <= 7:
    answer = input('今天好好学习了吗？')
    day = day + 1
    if answer != '有':
        print('今天好好学习了.')  # 如果输入的不是 “有”就打印这句“今天好好学习了”.
        break

else:
    print('连续7天好好学习了')

"""
执行流程  当输入“有”时:answer 的值为 '有'  条件 answer != '有' 为 False
if 分支的代码块(包含 print 和 break)不会执行.连break都不执行，所以继续循环.
循环继续下一次迭代
当输入不是“有”时(例如输入“是的”、“没”等):answer 的值不等于 '有'， 条件 answer != '有' 为 True
执行 if 分支的代码块:打印“今天好好学习了.”并 break 跳出循环.
"""


#循环的嵌套

i=1
while i<=9:

    j=1
    while j<=i:

        print(j,'*',i,'=',j*i,end=' ')
        j=j+1
    print()
    i=i+1

day=1
hour=1


