d =[1,2,3,4,5]
d[:] = "FishC"
print(d)
#--->['F','i','s','h','C']



"""
6. 我们知道，列表的 index() 方法可以找到第一个匹配元素的下标，那么你有没有办法在不改变原列表的情况下，
找到最后一个匹配元素的下标呢？（有两种方法可以实现）

0. 如果有一个列表，其中占比超过一半的元素称之为主要元素，那么如何获取一个列表的主要元素呢？
请根据解题思路进行编程。题目给定的列表是：[2, 2, 4, 2, 3, 6, 2]
根据主要元素的定义，对列表进行排序操作之后，主要元素必然会出现在列表长度一半之后的一个位置上。
所以，我们只需要判断列表中是否有超过一半的元素与中间元素相同即可（如果有，中间元素为主要元素；否则，不存在主要元素）。
1. 其实上面这道题有一个经典的解法，就是使用摩尔投票法（Boyer–Moore majority vote）。
摩尔投票法有时候也被称为“多数投票法”，该算法解决的问题是如何在任意多的候选人中（选票无序），找到获得票数最多的那个。
摩尔投票法分为两个阶段：来自：https://fishc.com.cn
对抗阶段：分属两个候选人的票数进行两两对抗抵消
计数阶段：计算对抗结果中最后留下的候选人票数是否有效
大家不妨可以将摩尔投票法的工作原理想象为诸侯争霸，假设每个国家都是全民皆兵，并且打起仗来都是以 1 换 1 的形式消耗人口，
当一个国家人口总数为 0，那么 Gameover，OK，如果某国人口数量超过所有国家总人口的一半，最终赢家就肯定是它。
好了，提示到此为止，大家开始专注搞代码吧！
"""

'''我们知道，列表的 index() 方法可以找到第一个匹配元素的下标，那么你有没有办法在不改变原列表的情况下，
找到最后一个匹配元素的下标呢？（有两种方法可以实现）
1,list.index([-1])
2，list.reverse()---->list.index(0)
'''

#####上面的作业没做对！！！！重做！！！

s=[1,2,3,4,5]
#print(s.index([-1]))#这是错误的，index(元素）而非index(下标索引值）。那么如何打印指定下标值的元素？
print(s.index(5))#---->4.即列表中5的下标值是4.
print(s[4])#---->5.打印列表下标值是4的元素。
print(s.index(3))#---->第一个3的下标索引值。


t=['a','b','c']
print(s+t)#列表可以合并。

print(s*3)#列表乘法就是列表内的元素重复出现3次

#嵌套列表：列表里面有列表：

matrix=[[1,2,3],[4,5,6],[7,8,9]]#matrix:举证，矩阵。
matrix=[[1,2,3],
        [4,5,6],
        [7,8,9]]
print(matrix)

for i in matrix:#访问嵌套列表
    for each in i:
        print(each)

for i in matrix:
    for each in i:
        print(each,end=' ')#不换行，但是两个之间空格或者end='*'，两个元素之间就是1*2*3.默认是end='\n',换行
    print()#换行打印

print(matrix[1])#打印的是matrix列表里的下标为1的一个列表元素。

print(matrix[0][2])#---->3得到嵌套列表的下标2的值：3


#用循环语句创建并初始化嵌套列表：循环嵌套其实就是得到一个二维的列表，一个矩阵。

a=[0]*3  #---->[0,0,0]列表的乘法，也就是列表内部元素的重复次数。
for i in range(3):#for循环：循环3次
    a[i]=[0]*3
print(a)

print([[0]*3]*3)


#range是个函数。是列出一个数列：
# range() 是 Python 里生成整数序列的函数，括号里的单个数字表示 “终止值”（不包含自身），且序列默认从 0 开始。
#用法： range(n),从0-（n-1）的数列     range(n,m):从n到m的数列，不含m。   range(n,m,d):从n到m-1，步进为d.


b=range(5)
print(b)#---->0,1,2,3,4

#is 对比两个变量的真值：即 内存地址是否完全相等。

j=['hello']
i=['hello']
print(bool(i is j))#---->False.因为i j是列表，列表的内存地址不相同。

j='hello'
i='hello'
print(bool(j is i))#---->True.因为：i 和 j 都是字符串。字符串是不可变的。'hello'的内存地址唯一，由j , i  指向这个唯一的地址。
