# 列表是可变的，所有没有两个内存地址完全相同的列表,除了赋值行为。把两个变量名赋值同一个内存地址。

# 创建一个变量时，Python是在内存中创建一个变量值，然后让变量名 引用 这个值

x = [1, 2, 3]
y = x
x[1] = 1
print(y)  # ---->[1,1,3]

#如果想得到两个独立的列表，还是需要copy来得到。
x=[1,2,3]
y=x.copy()
x[1]=1

print(x is y)#---->False
#这时候如果改变x列表，y不会改变：
print(y)

# y=x[:] == y=x.copy()
x=[[1,2,3],[4,5,6],[7,8,9]]
y=x.copy()#在嵌套列表中，浅拷贝，拷贝的是引用。用的是列表的copy方法。
x[1][1]=0#改变x列表的第二行的第二列的值为0
print(x)
print(y)#拷贝的只是其引用

#使用深拷贝：deepcopy
import copy
x=[[1,2,3],[4,5,6],[7,8,9]]
y=copy.copy(x)#拷贝的用法：copy模块的copy函数： y=copy.copy(x)。这种方法也是浅拷贝。x列表变化，y列表跟着变化。
print(y)
x[1][1]=0
print(y)

y=copy.deepcopy(x)
x[1][2]=0
print(x)
print(y)#经过深拷贝的y值还是以前的x值，并没有变成深拷贝之后才去改变的x的值。会拷贝所有数据，并固化。
