# 元组可以容纳多个元素，但也与字符串一样不可变。

tuple = (1, 2, 3, 4, 5, '上山打老虎')
tuple1 = 1, 2, 3, 4, 5, '上山打老虎'  # 元组可以不用()。元组的核心是 ，逗号。而非圆括号
tuple3 = 88,

print(tuple)
print(tuple1)
print(tuple3)
print(tuple[0])  # 元组也可以通过下标获取元素。

tuple4 = ('红的', '蓝的')

print(tuple4)
a = '黄'  # 字符串---->黄
print(a)
b = '黄',  # 元组---->('黄')
print(b)
# 元组可以应用各种切片操作：切片操作后是生成新的元组，不改变原来的元组。

print(tuple[:3])
print(tuple[:])  # 列出元组。。
print(tuple[::2])  # 步进为2

print(id(tuple))
print(tuple[::-1])  # 倒叙排列
print(id(tuple[:]))  # 与print(id(tuple))完全一致，说明是内存指向一致，是完全拷贝。

# 列表的方法有：增、删、改、查。但是元组只能 查，所以元组只支持count 和 index方法。
nums = (3, 1, 5, 7, 8, 5, 3, 5)
print(nums.count(5))  # ---->3 元组里有几个5

print(nums.index(3))  # ---->0 第一个值为3的元素下标为0
print(nums[3])  # ---->7 下标为3的元素值是7，与上面的index()方法正好是一正一反的效果

# 拼接 + 和重复 * 同样可以使用：
s = (1, 2, 3)
t = (4, 5, 6)

print(s + t)  # ---->(1,2,3,4,5,6)
print(s * 3)  # ---->(1,2,3,1,2,3,1,2,3)

# 元组也可以嵌套
w = s, t
print(w)  # ---->((1,2,3),(4,5,6)) 直接用 逗号分割，然后赋值给一个变量名就是一个嵌套元组啦。

# 元组同样支持迭代：
for i in s:
    print(i)
print(end='\n')

for i in w:  # ---->嵌套元组，用嵌套语句列出其元素。
    for j in i:
        print(j)

# 列表推导式可以用于元组吗？可以。

t = (1, 2, 3, 4, 5)
l = [i * 2 for i in t]#---->列表推导式
print(l)

ll=(i *2 for i in t)#---->这个叫 生成器表达式，会产生一个生成器
print(ll)#----><generator object <genexpr> at 0x000001AB283F8E10>
        #这不是元组推导式，Python也没有元组推导式。这是生成器。

#推荐元组一直加上圆括号，便读，不引起歧义。
#如何生成只有一个元素的元组？直接一个逗号了事。

m=('hello',)
print(m)


#打包与解包：

h=(1,2,3,'hello','你好',3.14)#把几个元素一起赋值给一个变量，就是打包

x,y,z,k,m,n=h#分别把h元组里面的元素赋值给对应的变量，叫 解包.新变量数量必须与元组的元素数量一致。
print(x,y,z,k,m,n)
print(x,m)

o,p,*q='world'#通过在变量名前加个*，可以赋值元组里的多个元素。只能最后一个变量？是的。*号解包变量。
print(o,p,q)

s=[1,2,3]
t=[4,5,6]
w=(s,t)
print(w)#---->([1,2,3],[4,5,6])
w[0][0]=0
print(w)#---->([0,2,3],[4,5,6])

"""
- 元组的不可变性指的是 元组本身的结构 不可变（长度、元素引用）
- 如果元组中包含可变对象，这些对象的 内容 是可以修改的
- 当元组作为列表元素时，你可以 替换整个元组 （因为列表可变），但不能修改元组内部的元素
"""