# “私有变量”：通过某种手段，使得某个对象的方法和属性不能被外部访问。一种保护机制。
# 这是大多数编程语言的都有的概念。但是，Python是开放的，所以，私有变量在这里加上了双引号。
# python 用name manglin的机制，（名字改编，改写，或名字修饰）.
# python 没有只从一个对象内部访问的"私有变量"


class C:
    def __init__(self, x):
        # 类里面的构造函数，创建、定义的是对象的属性。当创建对象时，会自动传入x值，x就是对象的属性。储存数据。
        self.__x = x
        # 这行代码的作用是将传入的参数 x 的值，赋值给当前实例的私有属性 __x。
        # __x是当前实例化对象的私有属性。
        # 并非真正的私有化。

    def set_x(self, x):
        # 创建对象的方法，用来执行操作。
        # 创建一个set_x方法，用来赋值、发送对象的值给私有变量。
        self.__x = x

    def get_x(self):
        # 定义一个函数，用来获得私有变量的值
        print(self.__x)


c = C(250)
# print(c.__x)
# 报错-->AttributeError: 'C' object has no attribute '__x'
# 因为这是一个私有变量__x，所以对象不能直接传入和获得，要用私有变量设定的接口传入和获得。
print(c.get_x())  # --->250

c.set_x(520)
# 用创建类的时候，设置的set_x()接口传入值。这个值可以随时改变。
print(c.get_x())  # --->520
# 用创建类时候，设置的get_x()接口获得值。
# Python 的私有变量并非真正的私有，只是通过名字修饰增加了访问难度，实际上可以通过 c._C__x 访问到。
print(c.__dict__)
# {'_C__x':520} 用__dict__来看看对象c的属性。表示有一个_C__x的属性，值是520。那么就可以直接访问这个属性：
print(c._C__x)
# -->520  果然，可以用这种方法来访问对象的私有属性。 __x是私有属性。 _C__x是这个类的小c这个对象的私有属性。


# 方法也是同样的道理：
class D:
    def __fun(self):
        print("hello python")


# d=D('jack')
# 报错：因为D()类没有__init__()构造函数，就不能传参。
# 即使有__init__(self)方法，但是没有参数，也不能接受传参。除非：(self,x)
d = D()
# print(d.__fun(888))
# 也会报错。原因与上面的d=D()一样，方法__fun(self)没有设定参数，所以不能接受参数。
print(d._D__fun())  # 通过对私有方法__fun()进行名称修饰： _D__fun()来访问。
# --->hello python

# 不建议这么做。因为既然设为私有的方法和属性了，就是不想被外部调用。这是一个后门？

"""
✅ 1. Python 的“私有”不是真正的私有
在 Python 中，使用双下划线 __ 开头的属性或方法（如 __x、__fun)并不是真正意义上的“私有”，而是通过 name mangling（名字修饰） 实现的一种保护机制。

当你定义一个私有属性/方法时,Python 会自动将其改名为 _ClassName__attr。
比如:self.__x → 实际上是 self._C__x
这样做的目的是防止子类意外覆盖父类的私有成员。
"""


print("-" * 88)

# 在实例化对象被创建后，仍然可以创建新的私有属性：
c.__y = 80
print(c.__dict__)
# -->{'-C__x':520,'__y':80}  __y并没有被类C改编名字。 如果改编了，应该是_C__y,而非__y.
# 名字改编是发生在类实例化的时候。

# 双下划线开头的变量是私有变量。而单下划线_开头结尾的变量是保护变量。是内部变量。
# 看到这样的命名名字，我们就不要去访问它。这是python的约定成俗的。
# class :如果必须使用class关键字，那么可以在class后面加上一个下划线： class_


# 效率
# 对象的属性都是放到一个字典里面  {'name':'小甲鱼','age':18}


class C:
    def __init__(self, x):
        self.x = x


c = C(100)
print(c.__dict__)
# -->{'x':100}
c.y = 200
# 后期添加属性。体现了对象的动态性，或者说这是类的对象的灵活性。
print(c.__dict__)
# -->{'x':100,'y':200}

# 甚至可以直接在字典里面添加键值对，从而改变（增加）对象的属性：
c.__dict__["z"] = 666

print(c.__dict__)
# -->{'x':100,'y':200,'z':666}

print(c.z)
# -->666

# 为啥字典和集合都能高效的运行呢，那是因为字典和集合用空间换来了时间啊。除了费内存之外，都是优点。如何取舍，看当时的情况。
# 有时候创建一个类的时候，很明确的就是用几个属性和方法，不会再扩展。那么就可以用slots方法，避免利用字典存放在空间上的浪费


class C:
    __slots__ = ["x", "y"]

    # 把对象的属性限制在 就x,y两项里。
    def __init__(self, x):
        self.x = x


c = C(889)
# 创建了一个属性受限制的对象小c:

print(c.x)
# -->889
c.y = 567
print(c.y)
# -->567
# print(c.__dict__)
# --->AttributeError: 'C' object has no attribute '__dict__'. Did you mean: '__dir__'?
# 这个类C没有属性字典。

# c.z=666
# 也会报错：AttributerError: 'C' objecet has no attribute 'z'
# 以上是动态的添加对象的属性。由于有__slots__的存在，都不行。


# 想要在类的内部创建一个__slots__不包含的属性，也是不可以的。
class D:
    __slots__ = ["x", "y"]

    def __init__(self, x, y, z):
        self.x = x
        self.y = y
        self.z = z


# d=D(10,20,30)

# --->报错： AttirbuteError: 'D' object has no attribute 'z'

# 因为用了__slots__属性，python 会划出固定的空间给这个类。此时，dict 就不需要了，从而节省了空间

# 继承自父类的__slots__属性，是不会在子类中起作用的。
# python只会关注各个具体的类中定义的__slots__属性


class E(C):
    pass


e = E(101)
# 实例化对象的时候必须填上具体的值
e.x = 101
print(e.x)
# --->101
e.y = 202
print(e.y)
# --->202

e.z = 303
print(e.z)
# --->303
print(e.__slots__)
# -->[]'x','y']  查看对象e的__slots__属性，是继承自类C的。
print(e.__dict__)
# -->{'z':303}
# 查看对象e的属性，有z:303这一项

# python 里 ，继承自父类的__slots__属性在子类中不生效，子类可以继续添加自己的属性。
