#总结。python 的灵活性就表现在可以程序设计的任何阶段，进行拦截和修改代码的执行逻辑
#python依靠什么来拦截和修改呢： 装饰器，魔法方法，描述符，元类这些高级的技巧。
#用好它们，就可以在近乎无损的情况下，对代码进行升级和改造。

#任何程序，函数之间的内部关联度非常高，所以不要轻易的重写某一个函数

#各种语言、各种编程任务，系统开发等等，底层逻辑是趋同的。搞懂一个语言的底层逻辑，可以轻松的上手其他的领域，只要再过一下需要的语法。

#python拥有众多的钩子，让它可以方便的拦截修改程序执行的逻辑，比如装饰符，描述符，魔法方法都是钩子（hook)
#因为它们都是挂在函数或类的前面，就可以实现了定向拦截

#不要重复的制造轮子，所以高级编程语言逐渐设计了有函数，类，对象元类等代码打包技术

#任何大型项目都是从大纲树粗枝大叶开始，然后逐渐细化，用装饰器添加检测功能，用描述符拦截属性操作。打磨优化过来的。
#它们的源代码就是优化过的，所以到处可见 闭包、装饰器，描述符，元类这些高级技巧，并且混合叠加使用

##多学些高级技巧，是架构师的必要本领。多学些，解决问题的路径就多一些。

#死磕成就不凡！！！！

#回头看看，好像真的很简单。
