# if __name__=='__main__'

"""摄氏度-->华氏度"""


def c2f(c):
    f = c * 1.8 + 32
    return f


"""华氏度-->摄氏度"""


def f2c(f):
    c = (f - 32) / 1.8
    return c


print(f"测试，0摄氏度={c2f(0):.2f} 华氏度")
print(f"测试，0华氏度={f2c(0):.2f} 摄氏度")
# 以上是tc.py文件的内容。

import tc  #  或者from tc import *


print(f"32摄氏度={tc.c2f(32):.2f}华氏度")
print(f"99华氏度={tc.f2c(99):.2f}摄氏度")
# --->测试，0摄氏度=32.00 华氏度
# --->测试，0华氏度=-17.78 摄氏度
# --->32摄氏度=89.60华氏度
# --->99华氏度=37.22摄氏度

# 模块被导入后，会从头到尾完全执行一遍的。
# 模块tc.py本身就有两行测试语句，加上主文件的两行print语句，所以打印了4行结果。


# 解决办法： 在模块里添加 if __name__='__main__' .当一个模块作为脚本，独立执行的时候，它的__name__属性就会被赋值为'__main__'
# 因此，只要在模块执行前判断__name__是否等于'__main__',就可以解决问题。
# 核心原因：__name__ 的值在“被导入”和“作为主程序运行”时是不一样的。

# 一、__name__ 的两个值
# 执行方式	                          __name__ 的值	                 说明
# 作为主程序运行（直接运行这个文件）	'__main__'	                   Python 把正在运行的文件命名为 __main__
# 被导入为模块（import tc）	          'tc'（模块名）	              Python 把模块的名字赋值给 __name__

# 这个机制的作用是：让一个文件既可以当作独立脚本运行（做测试），又可以当作模块被其他文件导入使用（不执行测试代码）。
# if __name__ == '__main__': 的原理是：
# 文件直接运行时，__name__ 是 '__main__'；tc.py直接运行，执行两个print()语句。
# 被导入时，__name__ 是模块名 'tc'。  tc.py被导入，就不执行自己的那两个print()语句。
# 所以通过判断 __name__ 的值，就能区分“当前文件是被运行还是被导入”，从而控制哪些代码只在直接运行时执行。


# if __name__=='__main__':  它必须在要执行的代码之前。因为 Python 是逐行执行的，如果 if 语句出现在调用函数之后，而函数还没定义，就会报错
# 它是个判断语句，要保持正确的缩进。


#可以在tc.py中，直接用print(f'__name__的值是{__name__})来验证其值是'__main__'.
#到了tc_test.py里，会得到__name__的值是tc.


#包：
#一个大型的程序，常常会涉及到很多的源代码文件，如果都放到一起，会产生混淆。
#这时候需要通过 文件夹的形式，将这些源代码文件整理、分类。这个文件夹就是 包。package
#python允许通过(.)号，将源文件组织成多个 分级的形式。即：支持将不同的模块分门别类，放入不同的文件夹中

#新建一个文件夹：TC,将文件tc.py放入文件夹TC中。如果是python3.3之前的版本，这个文件夹里必须建立一个__init__.py文件。这就是一个包TC.

#在导入的时候，用(.)号将包和模块名分隔   import TC.tc.
#因为导入的是TC.tc，所以print(f'32摄氏度={TC.tc.c2f(32):.2f}华氏度')，要改为TC.tc.c2f


#__init__，python的构造函数。在package中，也承担着类似的功能，可以通过编写该文件，对 包进行初始化操作。
#现在打开TC/__init__.py文件，并编辑：print(f'调用__init__,此时__name__值是{__name__}')
#然后到tc.test.py运行。


#编辑TC文件夹中的__init__.py文件，增加了一行： print(f'__init__.py被调用，__name__的值是{__name__}'),运行tc_test.py的结果是：
#__init__.py 被调用，__name__的值是TC
# __name__的值是TC.tc
# 32摄氏度=89.60华氏度
# 99华氏度=37.22摄氏度

#包被导入的时候，__init__.py就被调用。此时__name__值是TC


#作为负责初始化工作的文件，可以在里面定义 属于包的全局变量：
#编辑 __init__.py,增加两个变量： x=520,y='python',然后在模块tc.py中去访问

#需要在tc.py中增加： def printx(): ---->import TC.tc  ----> print(TC.x)---->本文件不能直接用 printx()的方法访问自己外部的包

#在tc_test.py中导入import TC.tc 可以访问包TC的全局变量：TC.tc.printx(),
#甚至修改包全局变量，x=1000。 但这个值只会存在于tc_test.py中，不会更改包TC的源文件的全局变量。只是导入了包，把包的数据存在内存，可以改，但没法影响包。

#如果有多个包层层包裹，可以用以下两个方法实现访问：
#1，用import ... as ...别名 的方法，给模块起个名，然后直接用这个名字

#2，在包的__init__.py中，加上： import TC.tc 别的文件导入包的时候，直接导入模块，tc_test.py 只要import TC就可以了。

