i=1

while i<10:
    j=1
    while j<=i:
        print(f'{i}*{j}={i*j}',end='\t')
        j=j+1
    print()
    i=i+1
    

#下面是把i=i+1这个推动器的位置顺序提前到外循环条件一开始的样子：    
i = 1  # 定义赋值变量，也可以叫计数器。从1开始。
while i <= 9:  # 外循环的条件，等于i<10.
    i=i+1    
    j = 1  # 为啥是j=1？#一个缩进表示属于外层循环，外循环每一遍，都要执行一次。为啥=1？表示内循环每次从1开始。
    while j <= i:
        print(f'{j}*{i}={j * i}', end='\t')  # print默认是end=\n,就是换行。这里用\t制表符，不换行，有缩进。
        j = j + 1
    print()  # 打印空行，每一次内循环结束后就来一个空行。
    #i = i + 1  # 推动外循环往9走。超过9，条件不符了就完成外循环，外循环结束。
    #这个外循环推动器可以写在外循环条件while i<=9:下一行不？
