# list列表[1,2,'a','k',78,'我们'，-90，'sun','moon'],除了数字，都要用''包裹。可变

rh = [213, 4, 'had', 'my', '你还好', 'len', 'a', 1, 2, 'a', 'k', 78, '我们', -90, 'sun', 'moon']
for i in rh:
    print(i, end='\t')  # 加上 end='\t'就可以同一行显示，每个元素之间四个空格。

#rh列表有16个元素，它们的下标从0-15.其中[6]和[9]都是'a'.
print(len(rh))  #---->16

print(rh[6],rh[9])#用下标一次打印多个选中的元素。如果是rh[6:9]那是切片范围，连续输出第6-8元素，不含9.
print(rh[-1])#---->moon,倒数第一个元素

print(rh[:4])#---->[213,4,'had','my'],为啥是个列表？因为切片操作只返回一个新的列表

print(rh[4:])#---->从下标4的开始，所有后面的元素的一个新列表：从['你还好'---'moon']

print(rh[:])#---->重现列表rh

print(rh[3:10:2])#---->['my','len',1,'a']从下标3到10，步进为2

print(rh[::2])#---->全列表每隔一个显示，步进为2

print(rh[::-2])#---->['moon',-90,78,'a',1,'len','my',4]从后往前，

print(rh[::-1])#---->列表从后往前。

#切片不改变原来序列的类型：原来是列表，还是列表，原来是集合，还是集合。原来是字符串，还是字符串。
#单个[n]是单个第几个元素，带冒号的就是新的列表： [ : ] 返回新列表